{
  "bos_token_id": 5,
  "class_token_index": 32006,
  "dropout": 0.4,
  "embed_ent_token": true,
  "encoder_config": {
    "_name_or_path": "almanach/camembert-bio-base",
    "add_cross_attention": false,
    "architectures": [
      "CamembertForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": 5,
    "chunk_size_feed_forward": 0,
    "classifier_dropout": null,
    "dtype": "float32",
    "eos_token_id": 6,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 514,
    "model_type": "camembert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_past": true,
    "pad_token_id": 1,
    "position_embedding_type": "absolute",
    "problem_type": null,
    "return_dict": true,
    "tie_word_embeddings": true,
    "type_vocab_size": 1,
    "use_cache": true,
    "vocab_size": 32008
  },
  "ent_token": "<<ENT>>",
  "eos_token_id": 6,
  "fine_tune": true,
  "fuse_layers": false,
  "hidden_size": 768,
  "id_to_classes": null,
  "max_len": 384,
  "max_neg_type_ratio": 1,
  "max_types": 25,
  "max_width": 12,
  "model_name": "almanach/camembert-bio-base",
  "model_type": null,
  "name": "cbio",
  "neg_spans_ratio": 1.0,
  "num_post_fusion_layers": 1,
  "num_rnn_layers": 1,
  "pad_token_id": 1,
  "post_fusion_schema": "",
  "precomputed_prompts_mode": null,
  "random_drop": true,
  "represent_spans": false,
  "sep_token": "<<SEP>>",
  "shuffle_types": true,
  "span_loss_coef": 1.0,
  "span_mode": "markerV0",
  "subtoken_pooling": "first",
  "token_loss_coef": 1.0,
  "transformers_version": "5.6.2",
  "use_cache": false,
  "vocab_size": 32008,
  "words_splitter_type": "whitespace"
}
